app/controllers/root_controller.rb

SELECT "greetings".* FROM "greetings" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def index
    @greeting = Greeting.order('RANDOM()').first